//=============================================================================
//
// モデルマネージャー処理(model_manager.h)
// Author : 唐﨑結斗
// 概要 : モデルマネージャーの設定を行う
//
//=============================================================================
#ifndef _MODEL_MANAGER_H_		// このマクロ定義がされてなかったら
#define _MODEL_MANAGER_H_		// 二重インクルード防止のマクロ定義

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "main.h"
#include "model3D.h"

//=============================================================================
// モデルマネージャークラス
// Author : 唐﨑結斗
// 概要 : モデルマネージャーの設定を行うクラス
//=============================================================================
class CModelManager
{
public:
	//--------------------------------------------------------------------
	// オブジェクトの配置情報
	// Author : 唐﨑結斗
	// 概要 : 敵の配置情報
	//--------------------------------------------------------------------
	struct OBJECT_SETER
	{
		D3DXVECTOR3		pos;	// 位置
		D3DXVECTOR3		rot;	// 向き
		D3DXVECTOR3		size;	// 大きさ
		int				nID;	// 識別番号
	};

	//--------------------------------------------------------------------
	// コンストラクタとデストラクタ
	//--------------------------------------------------------------------
	CModelManager();
	~CModelManager();

	//--------------------------------------------------------------------
	// メンバ関数
	//--------------------------------------------------------------------
	// 初期化
	void Init(void);

	// 終了
	void Uninit(void);

	// モデルマテリアル情報のゲッター
	CModel3D::MODEL_MATERIAL GetModelMateria(const int nNumModel) { return m_pModelMaterial[nNumModel]; }

	// ファイルの読み込み
	void LoadFile(const char *pFileName);

	// モデルの種別設定
	int GetMaxModelMaterial() { return m_nMaxModelMaterial; }

	// モデルのファイル名のゲッター
	char *GetFileName(const int nNumFile) { return &m_pModelMaterial[nNumFile].aFileName[0]; }

	// 背景モデルの設定
	void SetModelBG();

private:
	//--------------------------------------------------------------------
	// メンバ変数
	//--------------------------------------------------------------------
	CModel3D::MODEL_MATERIAL		*m_pModelMaterial;			// モデルのマテリアル情報
	OBJECT_SETER					*m_pObjectSeter;			// オブジェクトの配置設定
	int								m_nMaxModelMaterial;		// モデルの種別数
	int								m_nMaxSetModelBG;			// 背景モデルの設置数		
};

#endif

