//=============================================================================
//
// モーションキャラクター3Dクラス(model3D.h)
// Author : 唐﨑結斗
// 概要 : モーションキャラクター3D生成を行う
//
//=============================================================================

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <assert.h>

#include "motion_char3D.h"
#include "motion.h"
#include "renderer.h"
#include "application.h"

//=============================================================================
// インスタンス生成
// Author : 唐﨑結斗
// 概要 : モーションキャラクター3Dを生成する
//=============================================================================
CMotionChar3D * CMotionChar3D::Create(const char *pName)
{
	// オブジェクトインスタンス
	CMotionChar3D *pMotionChar3D = nullptr;

	// メモリの解放
	pMotionChar3D = new CMotionChar3D;

	// メモリの確保ができなかった
	assert(pMotionChar3D != nullptr);

	// 数値の初期化
	pMotionChar3D->Init(pName);

	// インスタンスを返す
	return pMotionChar3D;
}

//=============================================================================
// コンストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス生成時に行う処理
//=============================================================================
CMotionChar3D::CMotionChar3D() : m_pMotion(nullptr)
{
	
}

//=============================================================================
// デストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス終了時に行う処理
//=============================================================================
CMotionChar3D::~CMotionChar3D()
{

}

//=============================================================================
// 初期化
// Author : 唐﨑結斗
// 概要 : 頂点バッファを生成し、メンバ変数の初期値を設定
//=============================================================================
HRESULT CMotionChar3D::Init(const char *pName)
{
	// 初期化
	CModel3D::Init();

	// モーション情報
	m_pMotion = new CMotion(pName);
	assert(m_pMotion != nullptr);

	return E_NOTIMPL;
}

//=============================================================================
// 終了
// Author : 唐﨑結斗
// 概要 : テクスチャのポインタと頂点バッファの解放
//=============================================================================
void CMotionChar3D::Uninit()
{
	if (m_pMotion != nullptr)
	{// 終了処理
		m_pMotion->Uninit();

		// メモリの解放
		delete m_pMotion;
		m_pMotion = nullptr;
	}

	// 終了
	CModel3D::Uninit();
}

//=============================================================================
// 更新
// Author : 唐﨑結斗
// 概要 : 2D更新を行う
//=============================================================================
void CMotionChar3D::Update()
{
	// 更新
	CModel3D::Update();

	// モーション番号の設定
	m_pMotion->Update();
}

//=============================================================================
// 描画
// Author : 唐﨑結斗
// 概要 : 2D描画を行う
//=============================================================================
void CMotionChar3D::Draw()
{
	// 描画
	CModel3D::Draw();

	// ワールドマトリックスの取得
	D3DXMATRIX mtxWorld = GetMtxWorld();

	// パーツの描画設定
	m_pMotion->SetParts(mtxWorld);
}

//=============================================================================
// モーションの再読み込み
// Author : 唐﨑結斗
// 概要 : モーションの再読み込みを行う
//=============================================================================
void CMotionChar3D::ReloadMotion(const char *pName)
{// モーションの再読み込み
	m_pMotion->ReloadMotion(pName);
}
